Revit 2027 API
IFCData Constructor
 Creates a copy object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCData(
	IFCData from
)
Public Sub New (
	from As IFCData
)
public:
IFCData(
	IFCData^ from
)
new :
        from : IFCData -> IFCData
Parameters
from IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace